---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.GetEnumerator
source: html/2abc4bda-6885-8245-4384-31bec9085ee0.htm
---
# Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.